archive/sem-3/Mathematics For Intelligent Systems 3/code/23MAT204PracticeSheet1/PracticeSheet1.org
* Homework
** Practice Sheet 1
*** Question 1
#+begin_src octave :results output :exports output
% 1
D = diag([24,10,5]);
e1 = [1;1;0];
e2 = [1;-1;0];
e3 = [0;0;1]
P = [e1 e2 e3];
A = P*D*inv(P)
% Diagonalization of A^5
A5 = P*D^5*inv(P)
#+end_src

#+RESULTS:
#+begin_example
e3 =

   0
   0
   1

A =

   17    7    0
    7   17    0
    0    0    5

A5 =

   4.0313e+06   3.9313e+06            0
   3.9313e+06   4.0313e+06            0
            0            0   3.1250e+03

#+end_example

#+begin_src java
int a;
#+end_src
#+RESULTS:

*** Question 2
#+begin_src octave :results output
A = randi([-3 3],5,5);
A = A - diag(diag(A));
eigenVal = [9;8;7;6;5];
A = A + eye(size(A));

A1 = triu(A);
A2 = tril(A);

newA = A2*A1;
B = newA*diag(eigenVal)*inv(newA)
#+end_src

#+RESULTS:
: B =
:
:     586   -181    192    132     53
:     434   -131    144     98     40
:    -375    111   -117    -88    -33
:   -1356    429   -450   -300   -125
:     -90     30    -30    -20     -3
:

*** Question 3
#+begin_src octave :results output
A = randi([-100 100],4,4);
A = A - diag(diag(A));
A = A + eye(size(A));
A1 = triu(A);
A2 = tril(A);
newA = A2*A1;
det(newA);
#+end_src

#+RESULTS:

*** Question 4
#+begin_src octave :results output
A = randi([-9 9],7,7);
A = A - diag(diag(A));
A = A + eye(size(A));
A1 = triu(A);
A2 = tril(A);
newA = A2*A1;
det(newA)
inv(newA)
#+end_src

#+RESULTS:
#+begin_example
ans = 1.0000
ans =

 Columns 1 through 6:

   1.4728e+09  -2.2230e+08  -2.1595e+07   6.2415e+06   7.3972e+05   1.5164e+05
   3.2524e+08  -4.9092e+07  -4.7691e+06   1.3784e+06   1.6336e+05   3.3488e+04
   8.7099e+07  -1.3147e+07  -1.2772e+06   3.6913e+05   4.3747e+04   8.9680e+03
   1.6211e+07  -2.4468e+06  -2.3770e+05   6.8700e+04   8.1420e+03   1.6690e+03
  -2.1562e+06   3.2546e+05   3.1617e+04  -9.1380e+03  -1.0830e+03  -2.2200e+02
   3.5039e+05  -5.2888e+04  -5.1380e+03   1.4850e+03   1.7600e+02   3.6000e+01
  -6.7723e+04   1.0222e+04   9.9300e+02  -2.8700e+02  -3.4000e+01  -7.0000e+00

 Column 7:

  -2.1169e+04
  -4.6750e+03
  -1.2520e+03
  -2.3300e+02
   3.1000e+01
  -5.0000e+00
   1.0000e+00

#+end_example

*** Question 5
#+begin_src octave :results output
% Create matrix with det 1
A = randi([0 1], 15,15);
A = A - diag(diag(A));
A = A + eye(size(A));
A1 = triu(A);
A2 = tril(A);
newA = A1*A2;
diagVec = ones(15,1);
diagVec(end) = 3;
S = diag(diagVec);
M = newA*S*inv(newA);
det(M)
#+end_src

#+RESULTS:

*** Question 6
#+begin_src octave :results output
A = [-4 1 1;1 -6 7; 1 7 -9];
P = randi(15,3);
B = P*A*inv(P)
P = randi(15,3);
C = P*A*inv(P)
#+end_src

#+RESULTS:
#+begin_example
B =

  -25.6923    1.6154   23.6154
   21.1231   -4.7538  -15.5538
  -12.8769    1.2462   11.4462

C =

   -8.8925    3.9283    1.2801
   -8.8393   -6.2182   11.7622
   -7.2986    8.0879   -3.8893

#+end_example

*** Question 7
#+begin_src octave :results output
A = randi([1 9],10,3)*randi([1 9],3,5);
S = A*A'
S = A'*A
#+end_src

#+RESULTS:
#+begin_example
S =

   38635   26742   27483   30306   28698   35493   54225   39902   31388   46897
   26742   18717   19035   21318   20037   24846   37752   27723   21936   32541
   27483   19035   19862   21632   20895   25225   38897   28383   22296   33208
   30306   21318   21632   24344   22878   28294   42950   31470   24960   36892
   28698   20037   20895   22878   22173   26538   40932   29715   23424   34665
   35493   24846   25225   28294   26538   32987   50071   36798   29124   43211
   54225   37752   38897   42950   40932   50071   76649   56106   44232   65749
   39902   27723   28383   31470   29715   36798   56106   41263   32524   48479
   31388   21936   22296   24960   23424   29124   44232   32524   25720   38204
   46897   32541   33208   36892   34665   43211   65749   48479   38204   57036

S =

    62253    71046    50226    58404    84210
    71046    82585    58001    67748    96957
    50226    58001    40908    47594    68684
    58404    67748    47594    55596    79522
    84210    96957    68684    79522   116044

#+end_example

*** Question 9
#+begin_src octave :results output
A = randi([1 9],10,3)*randi([1 9],3,5);
S = A*A' 
S = A'*A 
#+end_src

#+RESULTS:
#+begin_example
S =

   61288   50026   73646   68814   46194   47986   68814   40814   47286   44596
   50026   41141   60033   56156   37248   38716   56156   32810   38336   36117
   73646   60033   88529   82742   55686   57794   82742   49264   56858   53647
   68814   56156   82742   77461   52119   53955   77461   46203   52981   50023
   46194   37248   55686   52119   35775   36909   52119   31935   35883   33963
   47986   38716   57794   53955   36909   38253   53955   32801   37371   35317
   68814   56156   82742   77461   52119   53955   77461   46203   52981   50023
   40814   32810   49264   46203   31935   32801   46203   28651   31695   30053
   47286   38336   56858   52981   35883   37371   52981   31695   36781   34687
   44596   36117   53647   50023   33963   35317   50023   30053   34687   32732

S =

   135639   144287   100967   103096    98531
   144287   154635   107931   108640   105535
   100967   107931    76059    76624    73279
   103096   108640    76624    79472    74032
    98531   105535    73279    74032    72267

#+end_example

*** Question 10
#+begin_src octave :results output
A = randi([1 2],4,4);
A = A - diag(diag(A));
A = A + eye(size(A));
A1 = triu(A);
A2 = triu(A);
newA = A2*A1;
eigVal = [1 2 3 4];
S = diag(eigVal);
D = newA*S*inv(newA);
A = (D-eigVal(1)*eye(size(A)))
B = (D-eigVal(2)*eye(size(A)))
C = (D-eigVal(3)*eye(size(A))*(D-eigVal(4)*eye(size(A))))
#+end_src

#+RESULTS:
#+begin_example
A =

   0   4   0   0
   0   1   4   4
   0   0   2   2
   0   0   0   3

B =

  -1   4   0   0
   0   0   4   4
   0   0   1   2
   0   0   0   2

C =

   10   -8    0    0
    0    8   -8   -8
    0    0    6   -4
    0    0    0    4

#+end_example
